app/views/gossips/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 13]]
---
			<p class="small_text"> Commentaires :
			<%= gossip.comments.count %> </p>