app/views/gossips/show.html.erb

  <div class="row">
  <h2 class="title">Tous les commentaires(<%= @gossip.comments.count %>)</h2>
    <% @gossip.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 16]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 16]]