app/controllers/comments_controller.rb

	def create
		@gossip = Gossip.find(params[:gossip_id])
		@comment = @gossip.comments.create(comment_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "comments" ("anonymous_commentor", "body", "created_at", "updated_at", "gossip_id") VALUES (?, ?, ?, ?, ?)  [["anonymous_commentor", "nique"], ["body", "sa mere"], ["created_at", "2018-05-01 11:20:43.961052"], ["updated_at", "2018-05-01 11:20:43.961052"], ["gossip_id", 8]]

	def edit
		@gossip = Gossip.find_by(id: params[:gossip_id])
	    @comment = Comment.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  	def update
	    @comment = Comment.find(params[:id])
	    @comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "c'est nase!!!!!!"], ["updated_at", "2018-05-01 14:19:20.996471"], ["id", 1]]