app/controllers/gossips_controller.rb

  def create
  	@gossip = Gossip.create(params.permit(:anonymous_author, :content, :id))
---
INSERT INTO "gossips" ("anonymous_author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["anonymous_author", "kiuj"], ["content", "hygbtd"], ["created_at", "2018-04-30 17:01:13.949676"], ["updated_at", "2018-04-30 17:01:13.949676"]]

  def show
  	@gossip= Gossip.find_by(id: params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def edit
    @gossip= Gossip.find_by(id: params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @gossip = Gossip.find_by(id: params[:id])
    gossip_params = params.require(:gossip).permit(:anonymous_author, :content)
    @gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = ?, "updated_at" = ? WHERE "gossips"."id" = ?  [["content", "bonjour"], ["updated_at", "2018-04-30 18:05:28.654997"], ["id", 1]]

  def destroy
    @gossip = Gossip.find_by(id: params[:id])
    @gossip.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = ?  [["id", 1]]